Revit 2026 API

# ElectricalSystemCreate(Document, IListElementId, ElectricalSystemType) Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElectricalSystem Create(
	Document document,
	IList<ElementId> electComponents,
	ElectricalSystemType elecSysType
)
```
```vb
Public Shared Function Create (
	document As Document,
	electComponents As IList(Of ElementId),
	elecSysType As ElectricalSystemType
) As ElectricalSystem
```
```cpp
public:
static ElectricalSystem^ Create(
	Document^ document,
	IList<ElementId^>^ electComponents,
	ElectricalSystemType elecSysType
)
```
```fsharp
static member Create :
        document : Document *
        electComponents : IList<ElementId> *
        elecSysType : ElectricalSystemType -> ElectricalSystem
```

#### Parameters

document Document

electComponents IListElementId

elecSysType ElectricalSystemType

#### Return Value

ElectricalSystem

#### Reference

ElectricalSystem Class

Create Overload

Autodesk.Revit.DB.Electrical Namespace